# SQL Assignment

In [1]:
import pandas as pd
import sqlite3

from IPython.display import display, HTML

In [2]:
# Note that this is not the same db we have used in course videos, please download from this link
# https://drive.google.com/file/d/1O-1-L1DdNxEK6O6nG2jS31MbrMh-OnXM/view?usp=sharing

In [26]:
conn = sqlite3.connect("Db-IMDB-Assignment.db")

#### Overview of all tables

In [27]:
tables = pd.read_sql_query("SELECT NAME AS 'Table_Name' FROM sqlite_master WHERE type='table'",conn)
tables = tables["Table_Name"].values.tolist()

In [36]:
for table in tables:
    query = "PRAGMA TABLE_INFO({})".format(table)
    schema = pd.read_sql_query(query,conn)
    print("Schema of",table)
    display(schema)
    print("-"*100)
    print("\n")

Schema of Movie

   cid       name     type  notnull dflt_value  pk
0    0      index  INTEGER        0       None   0
1    1        MID     TEXT        0       None   0
2    2      title     TEXT        0       None   0
3    3       year     TEXT        0       None   0
4    4     rating     REAL        0       None   0
5    5  num_votes  INTEGER        0       None   0

----------------------------------------------------------------------------------------------------


Schema of Genre

   cid   name     type  notnull dflt_value  pk
0    0  index  INTEGER        0       None   0
1    1   Name     TEXT        0       None   0
2    2    GID  INTEGER        0       None   0

----------------------------------------------------------------------------------------------------


Schema of Language

   cid   name     type  notnull dflt_value  pk
0    0  index  INTEGER        0       None   0
1    1   Name     TEXT        0       None   0
2    2   LAID  INTEGER        0       None   0

----------------------------------------------------------------------------------------------------


Schema of Country

   cid   name     type  notnull dflt_value  pk
0    0  index  INTEGER        0       None   0
1    1   Name     TEXT        0       None   0
2    2    CID  INTEGER        0       None   0

----------------------------------------------------------------------------------------------------


Schema of Location

   cid   name     type  notnull dflt_value  pk
0    0  index  INTEGER        0       None   0
1    1   Name     TEXT        0       None   0
2    2    LID  INTEGER        0       None   0

----------------------------------------------------------------------------------------------------


Schema of M_Location

   cid   name     type  notnull dflt_value  pk
0    0  index  INTEGER        0       None   0
1    1    MID     TEXT        0       None   0
2    2    LID     REAL        0       None   0
3    3     ID  INTEGER        0       None   0

----------------------------------------------------------------------------------------------------


Schema of M_Country

   cid   name     type  notnull dflt_value  pk
0    0  index  INTEGER        0       None   0
1    1    MID     TEXT        0       None   0
2    2    CID     REAL        0       None   0
3    3     ID  INTEGER        0       None   0

----------------------------------------------------------------------------------------------------


Schema of M_Language

   cid   name     type  notnull dflt_value  pk
0    0  index  INTEGER        0       None   0
1    1    MID     TEXT        0       None   0
2    2   LAID  INTEGER        0       None   0
3    3     ID  INTEGER        0       None   0

----------------------------------------------------------------------------------------------------


Schema of M_Genre

   cid   name     type  notnull dflt_value  pk
0    0  index  INTEGER        0       None   0
1    1    MID     TEXT        0       None   0
2    2    GID  INTEGER        0       None   0
3    3     ID  INTEGER        0       None   0

----------------------------------------------------------------------------------------------------


Schema of Person

   cid    name     type  notnull dflt_value  pk
0    0   index  INTEGER        0       None   0
1    1     PID     TEXT        0       None   0
2    2    Name     TEXT        0       None   0
3    3  Gender     TEXT        0       None   0

----------------------------------------------------------------------------------------------------


Schema of M_Producer

   cid   name     type  notnull dflt_value  pk
0    0  index  INTEGER        0       None   0
1    1    MID     TEXT        0       None   0
2    2    PID     TEXT        0       None   0
3    3     ID  INTEGER        0       None   0

----------------------------------------------------------------------------------------------------


Schema of M_Director

   cid   name     type  notnull dflt_value  pk
0    0  index  INTEGER        0       None   0
1    1    MID     TEXT        0       None   0
2    2    PID     TEXT        0       None   0
3    3     ID  INTEGER        0       None   0

----------------------------------------------------------------------------------------------------


Schema of M_Cast

   cid   name     type  notnull dflt_value  pk
0    0  index  INTEGER        0       None   0
1    1    MID     TEXT        0       None   0
2    2    PID     TEXT        0       None   0
3    3     ID  INTEGER        0       None   0

----------------------------------------------------------------------------------------------------

## Useful tips:

1. the year column in 'Movie' table, will have few chracters other than numbers which you need to be preprocessed, you need to get a substring of last 4 characters, its better if you convert it as int type, ex: CAST(SUBSTR(TRIM(m.year),-4) AS INTEGER)

2. For almost all the TEXT columns we have show, please try to remove trailing spaces, you need to use TRIM() function

3. When you are doing count(coulmn) it won't consider the "NULL" values, you might need to explore other alternatives like Count(*)

## Q1 --- List all the directors who directed a 'Comedy' movie in a leap year. (You need to check that the genre is 'Comedyâ€™ and year is a leap year) Your query should return director name, the movie name, and the year.

<h4>To determine whether a year is a leap year, follow these steps:</h4>

<ul>
    <li><b>STEP-1:</b> If the year is evenly divisible by 4, go to step 2. Otherwise, go to step 5.</li>
    <li><b>STEP-2:</b> If the year is evenly divisible by 100, go to step 3. Otherwise, go to step 4.</li>
    <li><b>STEP-3:</b> If the year is evenly divisible by 400, go to step 4. Otherwise, go to step 5.</li>
    <li><b>STEP-4:</b> The year is a leap year (it has 366 days).</li>
    <li><b>STEP-5:</b> The year is not a leap year (it has 365 days).</li>
</ul>

Year 1900 is divisible by 4 and 100 but it is not divisible by 400, so it is not a leap year.

In [ ]:
%%time
def grader_1(q1):
    q1_results  = pd.read_sql_query(q1,conn)
    print(q1_results.head(10))
    assert (q1_results.shape == (232,3))

query1 = """ select * from Movie """
grader_1(query1)

   index        MID                       title  year  rating  num_votes
0      0  tt2388771                      Mowgli  2018     6.6      21967
1      1  tt5164214               Ocean's Eight  2018     6.2     110861
2      2  tt1365519                 Tomb Raider  2018     6.4     142585
3      3  tt0848228                The Avengers  2012     8.1    1137529
4      4  tt8239946                     Tumbbad  2018     8.5       7483
5      5  tt7027278                   Kedarnath  2018     5.5       1970
6      6  tt3498820  Captain America: Civil War  2016     7.8     536641
7      7  tt8108198                   Andhadhun  2018     9.0      18160
8      8  tt3741834                        Lion  2016     8.1     170216
9      9  tt6747420                Rajma Chawal  2018     5.7        681

AssertionError: ignored

## Q2 --- List the names of all the actors who played in the movie 'Anand' (1971)

In [ ]:
%%time
def grader_2(q2):
    q2_results  = pd.read_sql_query(q2,conn)
    print(q2_results.head(10))
    assert (q2_results.shape == (17,1))


query2 = """ *** Write your query for the question 2 *** """
grader_2(query2)

        Actor_Names
0  Amitabh Bachchan
1     Rajesh Khanna
2     Sumita Sanyal
3        Ramesh Deo
4         Seema Deo
5    Asit Kumar Sen
6        Dev Kishan
7      Atam Prakash
8     Lalita Kumari
9            Savita
Wall time: 43 ms

## Q3 --- List all the actors who acted in a film before 1970 and in a film after 1990. (That is: < 1970 and > 1990.)

In [29]:
%%time
# Write your sql query below

query = """
        SELECT *
        FROM M_cast JOIN Person ON trim(M_cast.PID)=Person.PID
        JOIN Movie ON trim(M_cast.MID)=trim(Movie.MID)
        WHERE MOvie.Year<1970
        """

q5a = pd.read_sql_query(query, conn)   
print(q5a.shape)
print(q5a.head(10))

(4880, 14)
   index        MID         PID    ID  index        PID             Name  \
0   1902  tt0043456   nm0719692  1902   1860  nm0719692   Michael Rennie
1   1903  tt0043456   nm0623658  1903   1861  nm0623658    Patricia Neal
2   1904  tt0043456   nm0549280  1904   1862  nm0549280     Hugh Marlowe
3   1905  tt0043456   nm0415488  1905   1863  nm0415488        Sam Jaffe
4   1906  tt0043456   nm0336474  1906   1864  nm0336474       Billy Gray
5   1907  tt0043456   nm0062592  1907   1865  nm0062592   Frances Bavier
6   1908  tt0043456   nm0552696  1908   1866  nm0552696      Lock Martin
7   1909  tt0043456   nm0013934  1909   1867  nm0013934   Patrick Aherne
8   1910  tt0043456   nm0045839  1910   1868  nm0045839     Walter Bacon
9   1911  tt0043456   nm0047008  1911   1869  nm0047008         Rama Bai

   Gender  index        MID                          title  year  rating  \
0    Male     28  tt0043456  The Day the Earth Stood Still  1951     7.8
1  Female     28  tt0043456  The Day the Earth Stood Still  1951     7.8
2    Male     28  tt0043456  The Day the Earth Stood Still  1951     7.8
3    Male     28  tt0043456  The Day the Earth Stood Still  1951     7.8
4    Male     28  tt0043456  The Day the Earth Stood Still  1951     7.8
5  Female     28  tt0043456  The Day the Earth Stood Still  1951     7.8
6    Male     28  tt0043456  The Day the Earth Stood Still  1951     7.8
7    Male     28  tt0043456  The Day the Earth Stood Still  1951     7.8
8    Male     28  tt0043456  The Day the Earth Stood Still  1951     7.8
9  Female     28  tt0043456  The Day the Earth Stood Still  1951     7.8

   num_votes
0      71047
1      71047
2      71047
3      71047
4      71047
5      71047
6      71047
7      71047
8      71047
9      71047
Wall time: 6.41 s

In [54]:
%%time
# Write your sql query below

query = """
        SELECT pers.PID
        FROM Person pers
        JOIN M_Cast mcast ON pers.PID=trim(mcast.PID)
        JOIN Movie mov ON mcast.MID=mov.MID
        WHERE CAST(substr(mov.year,-4) as integer)<1970
       
        """

q5_a = pd.read_sql_query(query, conn)    
print(q5a.shape)

(4942, 1)
Wall time: 305 ms

In [53]:
%%time
# Write your sql query below

query_b = """
        SELECT pers.PID
        FROM Person pers
        JOIN M_Cast mcast ON pers.PID=trim(mcast.PID)
        JOIN Movie mov ON mcast.MID=mov.MID
        WHERE CAST(substr(mov.year,-4) as integer)>1990
       
        """

q5_b = pd.read_sql_query(query_b, conn)    
print(q5a.shape)

(4942, 1)
Wall time: 473 ms

In [ ]:
%%time

def grader_3a(query_less_1970, query_more_1990):
    q3_a = pd.read_sql_query(query_less_1970,conn)
    q3_b = pd.read_sql_query(query_more_1990,conn)
    return (q3_a.shape == (4942,1)) and (q3_b.shape == (62570,1))

query_less_1970 =""" *** write the query to get all the id's of actors who acted before 1970 *** """
query_more_1990 =""" *** write the query to get all the id's of actors who acted after 1990  *** """
print(grader_3a(query_less_1970, query_more_1990))

# using the above two queries, you can find the answer to the given question

True
Wall time: 220 ms

In [10]:
%%time
def grader_3(q3):
    q3_results  = pd.read_sql_query(q3,conn)
    print(q3_results.head(10))
    assert (q3_results.shape == (300,1))

query3 = """
        SELECT p.Name
        FROM Person p
        INNER JOIN M_Cast mcast ON p.PID=trim(mcast.PID)
        INNER JOIN Movie mov ON mcast.MID=mov.MID
        WHERE mov.year<1970

        """
grader_3(query3)

(5450, 1)

AssertionError:

## Q4 --- List all directors who directed 10 movies or more, in descending order of the number of movies they directed. Return the directors' names and the number of movies each of them directed.

In [ ]:
%%time

def grader_4a(query_4a):
    query_4a = pd.read_sql_query(query_4a,conn)
    print(query_4a.head(10)) 
    return (query_4a.shape == (1462,2))

query_4a =""" *** Write a query, which will return all the directors(id's) along with the number of movies they directed *** """
print(grader_4a(query_4a))

# using the above query, you can write the answer to the given question

  Director_ID  Movie_Count
0   nm0000180            1
1   nm0000187            1
2   nm0000229            1
3   nm0000269            1
4   nm0000386            1
5   nm0000487            2
6   nm0000965            1
7   nm0001060            1
8   nm0001162            1
9   nm0001241            1
True
Wall time: 16 ms

In [ ]:
%%time
def grader_4(q4):
    q4_results  = pd.read_sql_query(q4,conn)
    print(q4_results.head(10))
    assert (q4_results.shape == (58,2))

query4 = """ *** Write your query for the question 4 *** """
grader_4(query4)

           Director_Name  Movie_Count
0           David Dhawan           39
1           Mahesh Bhatt           35
2           Priyadarshan           30
3        Ram Gopal Varma           30
4           Vikram Bhatt           29
5   Hrishikesh Mukherjee           27
6            Yash Chopra           21
7        Basu Chatterjee           19
8         Shakti Samanta           19
9           Subhash Ghai           18
Wall time: 32 ms

## Q5.a --- For each year, count the number of movies in that year that had only female actors.

In [59]:
queryaa = """
        select distinct movie.year,t1.movie_count from movie
        left join (
                    select movie.year year,count(distinct movie.mid) movie_count
                    from movie left join m_cast on m_cast.mid = movie.mid
                    left join person on person.pid = trim(m_cast.pid)
                    where movie.mid in(
                                        select movie.mid from movie left join m_cast on m_cast.mid = movie.mid
                                        left join person on person.pid = trim(m_cast.pid)
                                        group by movie.mid
                                        having count(distinct gender) = 1
                                     )
                    and gender = 'Female'
                    group by movie.year
                  )
        as t1 on movie.year=t1.year
        order by t1.movie_count desc, movie.year

        """

q5_a = pd.read_sql_query(queryaa, conn)    
print(q5_a.shape)
q5_a.head(10)

(125, 2)

     year  movie_count
0    1939          1.0
1    1999          1.0
2    2000          1.0
3  I 2018          1.0
4    1931          NaN
5    1936          NaN
6    1941          NaN
7    1943          NaN
8    1946          NaN
9    1947          NaN

In [63]:
%%time

# note that you don't need TRIM for person table

def grader_5aa(query_5aa):
    query_5aa = pd.read_sql_query(query_5aa,conn)
    print(query_5aa.head(10)) 
    return (query_5aa.shape == (8846,3))
#*** Write your query that will get movie id, and number of people for each geneder *** 

query_5aa ="""
                SELECT mov.mid,Count(per.gender)
                FROM Movie mov join M_cast on trim(mov.mid)=trim(M_cast.mid)
                JOIN person per ON trim(m_cast.pid)=per.pid
                group by per.gender
                """


print(grader_5aa(query_5aa))

         MID  Count(per.gender)
0  tt2388771                  0
1  tt2388771              23028
2  tt2388771              55215
False
Wall time: 1min 35s

In [62]:

def grader_5ab(query_5ab):
    query_5ab = pd.read_sql_query(query_5ab,conn)
    print(query_5ab.head(10)) 
    return (query_5ab.shape == (3469, 3))

query_5ab =""" *** Write your query that will have at least one male actor try to use query that you have written above *** """

print(grader_5ab(query_5ab))

# using the above queries, you can write the answer to the given question

DatabaseError: Execution failed on sql ' *** Write your query that will have at least one male actor try to use query that you have written above *** ': near "*": syntax error

In [ ]:
%%time
def grader_5a(q5a):
    q5a_results  = pd.read_sql_query(q5a,conn)
    print(q5a_results.head(10))
    assert (q5a_results.shape == (4,2))

query5a = """ *** Write your query for the question 5a *** """
grader_5a(query5a)

   YEAR  Female_Cast_Only_Movies
0  1939                        1
1  1999                        1
2  2000                        1
3  2018                        1
Wall time: 264 ms

## Q5.b --- Now include a small change: report for each year the percentage of movies in that year with only female actors, and the total number of movies made that year. For example, one answer will be: 1990 31.81 13522 meaning that in 1990 there were 13,522 movies, and 31.81% had only female actors. You do not need to round your answer.

In [68]:
%%time
def grader_5b(q5b):
    q5b_results  = pd.read_sql_query(q5b,conn)
    print(q5b_results.head(10))
    assert (q5b_results.shape == (4,3))

query5b = """    SELECT table1.year,table1.movie_count,table2.female_movie_count,(table2.female_movie_count/table1.movie_count)*100.00 as percent
    FROM
        (
            SELECT CAST(substr(mov1.year,-4) as integer) as year,COUNT(DISTINCT mov1.mid) as movie_count
            FROM movie mov1
            GROUP BY CAST(substr(mov1.year,-4) as integer)
        ) as table1
    JOIN
        (
          SELECT CAST(substr(mov.year,-4) as integer)as year ,COUNT(DISTINCT mov.MID) female_movie_count
          FROM Movie mov
          WHERE trim(mov.MID)NOT IN
            (
                SELECT trim(mcast.MID)
                FROM M_Cast mcast
                WHERE trim(mcast.PID) IN
                    (
                        SELECT p.PID
                        FROM Person p
                        WHERE p.Gender!='Female'
                    )
            )
          GROUP BY CAST(substr(mov.year,-4) as integer)   
        ) as table2
    ON table1.year=table2.year """
grader_5b(query5b)

   year  movie_count  female_movie_count  percent
0  1939            2                   1      0.0
1  1999           66                   1      0.0
2  2000           64                   1      0.0
3  2018          104                   1      0.0

AssertionError:

## Q6 --- Find the film(s) with the largest cast. Return the movie title and the size of the cast. By "cast size" we mean the number of distinct actors that played in that movie: if an actor played multiple roles, or if it simply occurs multiple times in casts, we still count her/him only once.

In [ ]:
%%time
def grader_6(q6):
    q6_results  = pd.read_sql_query(q6,conn)
    print(q6_results.head(10))
    assert (q6_results.shape == (3473, 2))

query6 = """ *** Write your query for the question 5b *** """
grader_6(query6)

                        title  count
0               Ocean's Eight    238
1                    Apaharan    233
2                        Gold    215
3             My Name Is Khan    213
4  Captain America: Civil War    191
5                    Geostorm    170
6                     Striker    165
7                        2012    154
8                      Pixels    144
9       Yamla Pagla Deewana 2    140
Wall time: 232 ms

### Q7 --- A decade is a sequence of 10 consecutive years. 
### For example, say in your database you have movie information starting from 1931. 
### the first decade is 1931, 1932, ..., 1940,
### the second decade is 1932, 1933, ..., 1941 and so on. 
### Find the decade D with the largest number of films and the total number of films in D.

In [ ]:
%%time
def grader_7a(q7a):
    q7a_results  = pd.read_sql_query(q7a,conn)
    print(q7a_results.head(10))
    assert (q7a_results.shape == (78, 2))

query7a = """ *** Write a query that computes number of movies in each year *** """
grader_7a(query7a)

# using the above query, you can write the answer to the given question

   Movie_Year  Total_Movies
0        1931             1
1        1936             3
2        1939             2
3        1941             1
4        1943             1
5        1946             2
6        1947             2
7        1948             3
8        1949             3
9        1950             2
Wall time: 12 ms

In [ ]:
%%time
def grader_7b(q7b):
    q7b_results  = pd.read_sql_query(q7b,conn)
    print(q7b_results.head(10))
    assert (q7b_results.shape == (713, 4))

query7b = """   
    *** 
    Write a query that will do joining of the above table(7a) with itself 
    such that you will join with only rows if the second tables year is <= current_year+9 and more than or equal current_year
    *** 
          """
grader_7b(query7b)
# if you see the below results the first movie year is less than 2nd movie year and 
# 2nd movie year is less or equal to the first movie year+9

# using the above query, you can write the answer to the given question

   Movie_Year  Total_Movies  Movie_Year  Total_Movies
0        1931             1        1931             1
1        1931             1        1936             3
2        1931             1        1939             2
3        1936             3        1936             3
4        1936             3        1939             2
5        1936             3        1941             1
6        1936             3        1943             1
7        1939             2        1939             2
8        1939             2        1941             1
9        1939             2        1943             1
Wall time: 24 ms

In [ ]:
%%time
def grader_7(q7):
    q7_results  = pd.read_sql_query(q7,conn)
    print(q7_results.head(10))
    assert (q7_results.shape == (1, 2))

query7 = """ *** Write a query that will return the decade that has maximum number of movies ***"""
grader_7(query7)
# if you check the output we are printinng all the year in that decade, its fine you can print 2008 or 2008-2017

   Decade_Movie_Count                                             Decade
0                1203  2008-2009-2010-2011-2012-2013-2014-2015-2016-2017
Wall time: 21 ms

## Q8 --- Find all the actors that made more movies with Yash Chopra than any other director.

(430, 3)

        actor   director  distinct_movies
0   nm0707271  nm0007181               11
1   nm0471443  nm0007181               10
2   nm0407002  nm0007181                9
3   nm0025630  nm0007181                8
4   nm0534501  nm0007181                8
5   nm0004434  nm0007181                7
6   nm0451600  nm0007181                7
7   nm0000821  nm0007181                6
8   nm0347901  nm0007181                5
9   nm0716851  nm0007181                5
10  nm0004564  nm0007181                4
11  nm0433945  nm0007181                4
12  nm0438501  nm0007181                4
13  nm0451321  nm0007181                4
14  nm0755087  nm0007181                4
15  nm0802183  nm0007181                4
16  nm0894340  nm0007181                4
17  nm0004435  nm0007181                3
18  nm0158332  nm0007181                3
19  nm0159159  nm0007181                3
20  nm0159165  nm0007181                3
21  nm0359845  nm0007181                3
22  nm0438463  nm0007181                3
23  nm0438465  nm0007181                3
24  nm0474876  nm0007181                3
25  nm0595923  nm0007181                3
26  nm0664109  nm0007181                3
27  nm0756378  nm0007181                3
28  nm7760187  nm0007181                3
29  nm9036653  nm0007181                3

In [111]:
queryaa = """
                
        """

q5_a = pd.read_sql_query(queryaa, conn)    
print(q5_a.shape)
q5_a.head(10)

(0, 2)

Empty DataFrame
Columns: [actor, max_distinct_movies]
Index: []

In [90]:
%%time
def grader_8a(q8a):
    q8a_results  = pd.read_sql_query(q8a,conn)
    print(q8a_results.head(10))
    assert (q8a_results.shape == (73408, 3))

#*** Write a query that will results in number of movies actor-director worked together ***
    
query8a =queryaa
grader_8a(query8a)

# using the above query, you can write the answer to the given question

      actors   director  distinct_movies
0  nm0000002  nm0496746                1
1  nm0000027  nm0000180                1
2  nm0000039  nm0896533                1
3  nm0000042  nm0896533                1
4  nm0000047  nm0004292                1
5  nm0000073  nm0485943                1
6  nm0000076  nm0000229                1
7  nm0000092  nm0178997                1
8  nm0000093  nm0000269                1
9  nm0000096  nm0113819                1
Wall time: 1min 36s

In [ ]:
%%time

def grader_8(q8):
    q8_results  = pd.read_sql_query(q8,conn)
    print(q8_results.head(10))
    print(q8_results.shape)
    assert (q8_results.shape == (245, 2))

query8 = """ *** Write a query that answers the 8th question ***"""
grader_8(query8)

                Name  count
0        Jagdish Raj     11
1   Manmohan Krishna     10
2           Iftekhar      9
3      Shashi Kapoor      7
4      Rakhee Gulzar      5
5     Waheeda Rehman      5
6           Ravikant      4
7     Achala Sachdev      4
8        Neetu Singh      4
9      Leela Chitnis      3
(245, 2)
Wall time: 864 ms

## Q9 --- The Shahrukh number of an actor is the length of the shortest path between the actor and Shahrukh Khan in the "co-acting" graph. That is, Shahrukh Khan has Shahrukh number 0; all actors who acted in the same film as Shahrukh have Shahrukh number 1; all actors who acted in the same film as some actor with Shahrukh number 1 have Shahrukh number 2, etc. Return all actors whose Shahrukh number is 2.

In [122]:
%%time
def grader_9a(q9a):
    q9a_results  = pd.read_sql_query(q9a,conn)
    print(q9a_results.head(10))
    print(q9a_results.shape)
    assert (q9a_results.shape == (2382, 1))

query9a = """ 
                   select distinct trim(pid)
                   from m_cast where mid in 
                     (
                      select mid
                      from m_cast
                      where trim(pid)
                      in 
                       (
                          select trim(pid)
                          from person
                          where trim(name) = "Shah Rukh Khan"
                        )
                     )
                    and trim(pid)
                    not in
                    (
                        select trim(pid)
                        from person
                        where trim(name) = "Shah Rukh Khan"
                     )

        """
grader_9a(query9a)
# using the above query, you can write the answer to the given question

# selecting actors who acted with srk (S1)
# selecting all movies where S1 actors acted, this forms S2 movies list
# selecting all actors who acted in S2 movies, this gives us S2 actors along with S1 actors
# removing S1 actors from the combined list of S1 & S2 actors, so that we get only S2 actors

   trim(pid)
0  nm0004418
1  nm1995953
2  nm2778261
3  nm0631373
4  nm0241935
5  nm0792116
6  nm1300111
7  nm0196375
8  nm1464837
9  nm2868019
(2382, 1)
Wall time: 104 ms

In [ ]:
%%time
def grader_9(q9):
    q9_results  = pd.read_sql_query(q9,conn)
    print(q9_results.head(10))
    print(q9_results.shape)
    assert (q9_results.shape == (25698, 1))

query9 = """ *** Write a query that answers the 9th question ***"""
grader_9(query9)

              Actor_Name
0           Freida Pinto
1            Rohan Chand
2           Damian Young
3        Waris Ahluwalia
4  Caroline Christl Long
5          Rajeev Pahuja
6      Michelle Santiago
7        Alicia Vikander
8           Dominic West
9         Walton Goggins
(25698, 1)
Wall time: 591 ms